envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <ConsultaCNPJRequest xmlns="http://www.prefeitura.sp.gov.br/nfe">
      <VersaoSchema>1</VersaoSchema>
      <MensagemXML><Cabecalho Versao="1">
    <CPFCNPJRemetente>
      <CNPJ>20018183000180</CNPJ>
    </CPFCNPJRemetente>
  </Cabecalho>
  <CNPJContribuinte>
    <CNPJ>20018183000180</CNPJ>
  </CNPJContribuinte></MensagemXML>
    </ConsultaCNPJRequest>
  </soap12:Body>
</soap12:Envelope>
